[
  {
    "id": "404-html",
    "type": "pages",
    "date": "",
    "title": "",
    "boosts": "",
    "tags": "",
    "content": "🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com 404 Page not found :( The requested page could not be found.",
    "url": "/404.html",
    "snippet": null
  },
  {
    "id": "about-html",
    "type": "pages",
    "date": "2023-09-20 11:26:00 -0700",
    "title": "About",
    "boosts": "",
    "tags": "",
    "content": "About 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Draft edited September 20, 2023 10:11 PM (PDT) See [the initial post here](https://danielsgriffin.com/ppost/2023/09/07/planning-SearchRights.html). This hosts the provisional comparative evaluation of new web search systems with a focus on dimensions around integrating with users' curiosity-engagement, question-generation, response validation, search repair, search sharing, complaint and feedback, and other concerns at the core of my research. The new attention to search, sparked by widespread interest in OpenAI's ChatGPT, has pushed many to develop new ways to search. This evaluation is a look towards comparing different search systems, with a particular eye towards finding and shining some light on systems that are opening up search in new ways. I have a wide range of criteria by which to provide some marks and remarks on these systems. I'll need to narrow them down and gradually work through them. I'm not thinking about them as goals, requirements, or desired-specifications, and some even may contradict. For some of the criteria I will provide citations as reference or support. Some criteria are drawn from examples in previous search systems (including shuttered, speculative, and experimental systems). My goal here is not to simply do an accounting of searching today, but to get some sense of where we might want search to go. Initial Search Systems In this initial set of reviews, I’m focusing on these search engines, listed alphabetically: Andi Search (andisearch.com) Metaphor (metaphor.systems) Perplexity AI (perplexity.ai) Phind (phind.com) You.com (you.com) These are my initial examples of new approaches to searching in generative web search systems. I may provide come contextualizing comments about other systems, like the explicit search-focused tools from Google and Microsoft, and chat-based systems like ChatGPT, Anthropic’s Claude, etc., that support search and search-like interactions. To they extend that they support public-facing search, I will also be examining newer search libraries and services (including RAG frameworks), like the offerings from LangChain, from LlamaIndex, and Weaviate’s Verba, with comparison to (the also adapting) existing tools like those from Algolia and Elasticsearch. Broad Criteria My criteria are broad. I’m focused on concerns my research and training best prepares me to engage with. These are broadly questions related to the explicit and implicit articulation of the search system, the interactions around queries and results, the ability to share the burden of search, and the formalized methods of complaint. I’ll do some explicit evaluations of atomic performance related to “hallucination” or “groundedness”, but my focus is more on how people perceive and perform-with tool outputs than the outputs themselves. How are the searchers ushered into their searches? What do they see as searchable? How can they engage with search results (or responses)? Are they expected to vet the responses for hallucinations? How is automation bias addressed? What post-search activities are supported by the search system itself? I’ll ask about features or uses that might perhaps be refused or reimagined, while situating this period of search amidst a longer history of search. There are importance concerns about misleading results, sources of training and reference data, oversight, and the future of work. I’m very much developing these reviews to acknowledge that these systems will keep changing. Where there are very important concerns that I am less well-versed in, like accessibility, I will leverage other resources. What searches can we avoid doing? What newly / more easily think to do? What make newly possible? What can be slower or faster? Seamful? Viscid? Vetted? Doubtful & deliberate? Ephemeral or persistent? Memorable? Public? Shared? Surfing or blazing? Embedded? Loosely coupled? Fun? Daniel Griffin, Sep 3, 2023 Scoping This is not intended to be an introductory guide to these systems, but focused on making sense of what new search tools are providing and what they might become. These reviews may be useful to heavy users, developers, and others looking to understand changes in system support for various searching practices. I will largely be looking at systems for web search, including those more focused to particular subject areas. Though important, these reviews will not (yet at least) engage with new search systems for: academic search: Examples: Consensus (consensus.app) Elicit (elicit.org) See: Michael Gusenbauer’s call for independent audits (author copy) Aaron Tay’s “categorization of interesting new academic discovery tools” enterprise search Examples: Glean (glean.com) Vectara (vectara.com) personal knowledge management Examples: Klu (klu.so) Rewind (rewind.ai) I will not be trying to replicate metrics like that in ragas (tagline: “Evaluation framework for your Retrieval Augmented Generation (RAG) pipelines”; from Exploding Gradient). Those metrics are intended to examine: Faithfulness, Context Relevancy, Context Recall, Answer Relevancy, Aspect Critiques. I’m more interested in actions outside the RAG-pipeline itself. What can be done to improve coordination between searcher expectation and system performance? What can be done to remedy system failures at searching-time? I will also not be focused on in-editor code generation tools (like GitHub’s Copilot) and writing tools (like Lex.page) that replace or subsume some searching tasks. I will not very focused on various metrics related to speed, unless it is very noticeable in frequent use. I am concerned about questions of bias, but here only insofar as these systems are markedly different from the prior problems found in search. I am not focused on explainability or transparency of these systems, though some question will definitely engage with those questions. I will be more focused on examining questions around seamfulness, tractability, and traceability. I will be thinking about how practical algorithmic knowledge [@cotter2022practical] is built up and valued. I’m less focused on responding to or rehashing and regurgitating arguments about “model collapse”, than perhaps looking at how these search tools and their users imagine supporting or working towards unsealing knowledge, whether through articulations that help users doubt & dig deeper, providing multiple drafts, or RAG adaptations. The most important work would be work looking at how these search systems and tools are imagined and used (or not) by other people. I am not looking at that right now, but I will look at aspects of the systems identified publicly by different users or others. Roadmap Add to system pages (background, reference data, reflections); scraping; interviews and guest commentary; glossary; reading list; suggested class exercises and discussion questions; add search functionality. Additional Criteria under Consideration (incomplete) Queries Do they support persistent queries? Does it autocorrect queries? Disclosure of rating and moderation practices. Different practices may cause more or less harm to the individuals tasks in those roles. These practices may also be a leading indicator of the trustworthiness of the system itself. See @meisner2022labor. Explicit statement about responsibility around something like ‘societal relevance’ [@sundin2021relevance]? Oversight Is there an oversight or advisory board of any type (outside of legal mandates? Comment: See AI ethics boards, Ethical Use Advisory Council, the Facebook Oversight board, etc., [@magassa2017diverse; @young2019inclusive] Feedback and Complaint Are there formal feedback mechanisms for the search results or conversation pages? What is the transparency around feedback? Are there examples of changes from community feedback? Community Are there sponsored community spaces (forums, workspaces)? Note: Often Discord channels, sometimes Slack Refining, Revising, and Reviewing Results Is there support for disambiguating terms used in questions? Are there clarification prompts? Are there suggested or related searches? Is there ‘faceted search’? Are follow-on searches supported in conversational interfaces? Are there branching searches? Can you re-generate the response? Can you adjust ‘temperature’? Can you ‘block results’? Can you ‘filter results’? Can you ‘sort results’? Safety Are there “safesearch” options? Are there statements about children using the system? Sharing Is there a way to share search sessions (multiple queries across a time period)? Is there a co-search function (share a link to a shared search session)? Standards, Openness, and Auditing Have they published academic research? Do they provide access to academic researchers or journalists? See, ex. Lurie’s comparison of platform research API requirements [@lurie2023comparing] Is there an engineering blog? Do they actively support user audits? TODO: pull from /docs/2023/07/05/search-audits.html See also: Feedback and Complaint above. Have there been external evaluations? History Is there a clear and accessible link to search history? Is there a search function in the search history? Disclaimers, Warnings, and Doubting Is there a disclaimer for searches with limited results? Perhaps like Google’s warning around so-called “data voids” [@golebiewski2018data; golebiewski2019data] Are there efforts to encourage appropriate “doubting” [lindemann2023sealed_paper; @lindemann2023sealed_poster] (or unsealing of knowledges)? Project This project is not externally funded. Daniel Griffin, Ph.D., is pursuing this work in the course of his research and job search.",
    "url": "/about.html",
    "snippet": null
  },
  {
    "id": "",
    "type": "pages",
    "date": "2023-09-08 14:59:16 -0700",
    "title": "SearchRights",
    "boosts": "",
    "tags": "",
    "content": "\n\n\n\n\n\n\n\nWelcome to SearchRights.org, a platform dedicated to the evaluation and promotion of search systems that focus on including the user. We critically evaluate search systems based on a robust, user-centric framework. We examine how search systems (from engines and agents to frameworks and tools) support searcher rights to:\n\nCompare: Explore and develop practical knowledge of various search systems for informed decisions.\nComplain &amp; Contest: Challenge systems when they fall short of user needs or expectations.\nRepair: Modify or fix search systems without facing unwarranted obstructions.\nShare: Involve others in searches, teach others about searching, and assemble to improve search.\nExtend: Adapt systems and practices.\nChoose: Freely select the search tools that resonate with individual needs, values, and aspirations.\nLearn: Cultivate curiosity and questions, address ignorance, and search even outside of clear tasks or goals.\n\nOur framework emphasizes:\n\n\nComparative Evaluations: Through rigorous and interdisciplinary methodologies, we provide clear comparisons of how various search systems support or challenge the searcher.\n\n\nDiversity: Our vision embraces the multitude of ways people search, promoting a landscape where different methodologies coexist and evolve.\n\n\nOur commitment at SearchRights.org is clear: to move beyond the status quo and ensure the search landscape prioritizes and truly includes its users.\n\n\n  About\n  See the Table\n  See the Log\n\n\n",
    "url": "/",
    "snippet": null
  },
  {
    "id": "assets-item-index-json",
    "type": "pages",
    "date": "",
    "title": "assets/item_index.json",
    "boosts": "",
    "tags": "",
    "content": "\n  \n    \n      {% assign index_title_only_list = “feed-xml”\n      split: “,” %}\n    \n  \n\n\n[\n{% for post in site.posts %}\n  {% assign id = post.url | slugify %}\n  {\n    “id”: “{{ post.url | slugify }}”,\n    “type”: “posts”,\n    “title”: “{{ post.title | xml_escape }}”,\n    “author”: “{{ post.author | xml_escape }}”,\n    “date”: “{{ post.date | xml_escape }}”,\n    “category”: “{{ post.categories | xml_escape | replace: ‘\"’, ‘’ }}”,\n    “tags”: “{{ post.tags | xml_escape | replace: ‘\"’, ‘’ }}”,\n    “boosts”: “{{ post.boosts | xml_escape }}”,\n    {% unless index_title_only_list contains post.id or post.index_title_only %}\n    “content”: {{ post.content | markdownify | strip_html | replace: ‘ ’, ‘ ‘ | jsonify }},\n    {% endunless %}\n    “url”: “{{ post.url | xml_escape }}”,\n    “snippet”: {{ site.data.gpt-summaries[id] | jsonify }}\n  }\n  {% unless forloop.last %},{% endunless %}\n{% endfor %}\n{% if site.posts.size &gt; 0 and site.pages.size &gt; 0 %},{% endif %}\n{% for page in site.pages %}\n  {% if page.lunrjs != ‘noindex’ and page.layout != ‘none’ %}\n    {% if forloop.first and site.posts.size &gt; 0 %},{% endif %}\n    {% assign id = page.url | slugify %}\n    {\n      “id”: “{{ page.url | slugify }}”,\n      “type”: \n        {% if page.url contains ‘diss/’ %}\n          “diss”\n        {% elsif page.url contains ‘shortcuts/’ %}\n          “shortcuts”\n        {% elsif page.url contains ‘courses/’ %}\n          “courses”\n        {% elsif page.url contains ‘tags/’ %}\n          “tags”\n        {% else %}\n          “pages”\n        {% endif %},\n      “date”: “{{ page.date | xml_escape }}”,\n      “title”: \n        {% if id == “feed-xml” %}\n          “feed.xml”\n        {% elsif id == “redirects-json” %}\n          “redirects.json”\n        {% else %}\n          “{{ page.title | xml_escape }}”\n        {% endif %},\n      “boosts”: “{{ page.boosts | xml_escape }}”,\n      “tags”: “{{ post.tags | replace: ‘\"’, ‘’ }}”,\n      {% unless index_title_only_list contains page.id or page.index_title_only %}\n      “content”: {{ page.content | markdownify | strip_html | replace: ‘ ’, ‘ ‘ | jsonify }},\n      {% endunless %}\n      “url”: “{{ page.url | xml_escape }}”,\n      “snippet”: {{ site.data.gpt-summaries[id] | jsonify }}\n    }\n    {% unless forloop.last %},{% endunless %}\n  {% endif %}\n{% endfor %}\n{% for external in site.data.external_pages %}\n  {% if forloop.first and site.pages.size &gt; 0 %},{% endif %}\n  {\n    “id”: “{{ external.url | slugify }}”,\n    “type”: “{{ external.type }}”,\n    “date”: “{{ external.date }}”,\n    “title”: “{{ external.title }}”,\n    “boosts”: “{{ external.boosts }}”,\n    “tags”: “{{ external.tags | replace: ‘\"’, ‘’ }}”,\n    “content”: {{ external.content | strip_html | strip_newlines | jsonify }},\n    “url”: “{{ external.url }}”,\n    “snippet”: {{ external.snippet | jsonify }}\n  }\n  {% unless forloop.last %},{% endunless %}\n{% endfor %}\n]\n",
    "url": "/assets/item_index.json",
    "snippet": null
  },
  {
    "id": "log-html",
    "type": "pages",
    "date": "2023-09-08 14:59:16 -0700",
    "title": "Log",
    "boosts": "",
    "tags": "",
    "content": "Log 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com 2023-09-08 15:08:02 Added to the ‘Is there a “searchable repository of examples” [@zamfirescu-pereira2023johnny]?’ remark for Perplexity AI: # 🔎 │ ask channel in the Discord channel: “ask \\@PerplexityAI anything. Check pinned for usage.” (with a weekly challenge for the best question; pinned message show example queries (note these are queries of their Discord bot)) 2023-09-08 15:09:22 Added to the ‘Is there a “searchable repository of examples” [@zamfirescu-pereira2023johnny]?’ criteria comment: See also the LangChain Hub prompt repository (not searchable). 2023-09-08 15:28:00 Added to the ‘Example searches’ criteria category comment: @mollick2023useful, not specifically re search systems, has called for “large-scale public libraries of prompts” 2023-09-08 15:31:06 Added link to the ‘Is there a “searchable repository of examples” [@zamfirescu-pereira2023johnny]?’ criteria text: to “A searchable repository of examples…” 2023-09-08 15:53:17 Added a paragraph re ragas under Scoping: I will not be trying to replicate metrics like that in ragas (tagline: “Evaluation framework for your Retrieval Augmented Generation (RAG) pipelines”; from Exploding Gradient). Those metrics are intended to examine: Faithfulness, Context Relevancy, Context Recall, Answer Relevancy, Aspect Critiques. I’m more interested in actions outside the RAG-pipeline itself. What can be done to improve coordination between searcher expectation and system performance? What can be done to remedy system failures at searching-time? 2023-09-08 16:57:49 Added Criteria (incomplete) 2023-09-11 16:12:08 Renamed Criteria (incomplete) to Additional Criteria under Consideration (incomplete) 2023-09-13 09:15:02 Refactored text, table, and markings. Various smaller edits w/in. 2023-09-13 12:06:17 Added example searches for Perplexity AI. 2023-09-15 16:29:49 Added &tbm=youchat to the link for You.com in /criteria/can-you-search-by-url#you-com 2023-09-21 14:03:18 Updated Phind’s mark for . I previously had it noted that you had to be signed in to share a search. I do not have documentation of that previous claim. Currently you do not need to be signed in. 2023-09-27 11:53:34 Added a ‘Sharing searching’ criteria: Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? (and made various UI changes). 2023-10-05 10:26:14 Transferred from danielsgriffin/projects/csuirx to SearchRights.org and rebranded from CSUIRx to SearchRights",
    "url": "/log.html",
    "snippet": null
  },
  {
    "id": "table-html",
    "type": "pages",
    "date": "2023-09-08 14:59:16 -0700",
    "title": "SearchRights Table",
    "boosts": "",
    "tags": "",
    "content": "SearchRights Table 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Example searches Help users practice new ways of imagining and formulating queries. Research suggests that effective prompting of LLMs can be challenging [@zamfirescu-pereira2023johnny] and query formulation even in mainstream web search engines is complicated [@tripodi2018searching]. @mollick2023useful, not specifically re search systems, has called for \"large-scale public libraries of prompts\". Are there default example searches? Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Yes Ex. [history of the birkin bag] [What is the Mandalorian?] [write a review of the best michelin star chefs in the world] Go to apps, eg [go aws console] Note that these are not links to searches because search-by-URL is not available in Andi. Yes Ex. [companies working on fusion] [blog posts to learn how LLMs work] [best restaurants in San Francisco] [fun concerts in San Francisco] Yes Clicking in the searchbox. Ex. [Morocco earthquake 2023] [how do bacteriophages differ from antibiotics] [what causes the Northern Lights] [super blue moon] [difference between stop motion and claymation] [future of artificial selection] [miracle berries] [how do reading skills change human brain] In the mobile app. Listed as 'Popular', ex. [examples of preventive medicine practices] [what are the most popular podcast categories] [breathtaking adventure books about Africa] [how does skiplagging work] Yes Listed as 'Explore', ex. [Why we shouldn't use useMemo() in React everywhere] [The 2005 Japanese PS2 videogame Ikusagami renders thousands of enemies on screen. How can I achieve this in Godot 4?] [Why are there so many potholes in SF and can I get money if my car is broken by one] [How do I conditionally import components in Astro?] [Compare and contrast H100 availability across Lambda Labs and AWS] Yes Ex. [Check today's weather] [Find cost-effective vacations] [Shop for running shoes] Do default example searches have contextually relevant explanation on sourcing? No No Partial On mobile app there are example searches listed above the search bar, explained only by the word 'Popular' No No Is there a \"searchable repository of examples\"? The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. No Partial `# show-and-tell` channel in the Discord channel: 'Show off what you've found with Metaphor!' Partial **(1)** `# 💗 | sharing` channel in the Discord channel: 'Share cool results that you got with Perplexity! Please keep everything safe and friendly.'**(2)** `# 🔎 │ ask` channel in the Discord channel: 'ask \\@perplexity anything. Check pinned for usage.' (with a weekly challenge for the best question; pinned message show example queries (note these are queries of their Discord bot))**(3)** A [Discover](https://www.perplexity.ai/discover) page shares 30 example queries. Partial `# 🤯impressive-results` channel in the Discord channel No `# create-and-share` channel in the Discord channel appears focused on image generation rather than searching with You.com All or YouChat. Sharing searching Support users in sharing their search experience with others. Research demonstrates significant value in users communicating about their experiences with tools. Better support for sharing interactions with these systems may improve users collective ability to effectively question/complain, teach, & organize about/around/against these tools (i.e. \"working around platform errors and limitations\" & \"virtual assembly work\" {% cite burrell2019control %}, \"repairing searching\" {% cite griffin2022situating %}, search quality complaints {% cite griffin2022search %}, and end-user audits {% cite metaxa2021auditing lam2022end %}) and improve our \"practical knowledge\" of the systems {% cite cotter2022practical %}. Can you share a link to the results or conversation? Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. No No Yes Yes Yes Requires sign-in. Is there an explanation of how the share interface works provided or linked to in the interface itself? Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: N/A N/A Partial The share link interface consists of the button, with a lock and labelled 'Share', and a popup showing the current 'Secret' state and an option to make 'Shareable:Clicking 'Shareable' copies the link and presents options to facilitate sharing directly to Twitter, WhatsApp, and Facebook: No The share link interface consists of the share button icon and a popup: Partial The share link interface consists of the share button icon and a popup which says 'Share YouChat transcript' and 'Anyone with a link will be able to view your full transcript with YouChat in this session.' and presents a link to the search: Do shared links update if the sharee's interaction with the system continues?? Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. N/A N/A (1) Links to searches reproduce the search from the URL.(2) Metaphor does not have follow-on queries/questions. Sometimes (1) It is not explicitly stated, but it appears that further interactions by the sharer on the same 'thread' may break the original link (`error=ThreadAccessNotAllowed` appears in the URL, and there is a temporary popup saying the same; try: example): (2) Perplexity has another way to share as well: Collections. A search shared to a collection and then subsequently expanded is updated for the sharee(s). No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link. No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link. Is there a social share card? Quality of share cards may influence the engagement on social platforms. No Yes Links to searches produce a social share card. Yes Share interface links produce a social share card. No Yes Share interface links produce a social share card. Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. N/A Yes You can find links to searches in Google: g[site:https://metaphor.systems/search].Note: There are no 'conversations' on Metaphor.Google result count: 6 Yes You can find shared links on Google: g[site:https://www.perplexity.ai/search/]Many of these searches may be sourced from the links provided on the Perplexity AI Discover page (which appear to be from Perplexity Bot (accessed via their Discord server). Perplexity Bot is identified as the account for many of the searches found on Google (example link here), others are anonymously sourced (example) or identified accounts (N.b. A few of the results are links I've shared myself: g[site:perplexity.ai/search danielsgriffin].Google result count: 3,210 Yes You can find shared links on Google: g[site:phind.com/search]Note: Finding a Jan 19, 2023 tweet from Phind's CEO is what initiated my review of this criteria.Google result count: 6 Partial You can find links to searches on Google: g[site:you.com/search]Google result count: 267It does not appear that shared YouChat links are currently searchable on Google. @vijayabhaskarj reported finding chat links on Google on Jun 4, 2023. Standards & Openness Support interoperability and extensibility. This includes checking if a platform supports searching by URL and if it offers an API.Coming soon: Examine support for the OpenSearch protocol ([mdn](https://developer.mozilla.org/en-US/docs/Web/OpenSearch) | [GitHub](https://github.com/dewitt/opensearch) | [Wikipedia](https://en.wikipedia.org/wiki/OpenSearch)); record comments about open source; record contributions to & integrations from open source. Can you search by URL? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. No Yes Example: What is an LLM? Yes Example: What is an LLM? Yes Example: What is an LLM? Yes Example: What is an LLM? Is there an API? Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. No Yes No No No You.com does not offer an API for search or chat at this time. However, we are considering creating one in the future. If you would like to be notified when this happens, fill out the form here. source",
    "url": "/table.html",
    "snippet": null
  },
  {
    "id": "assets-main-css",
    "type": "pages",
    "date": "",
    "title": "",
    "boosts": "",
    "tags": "",
    "content": "@import “minima”;\n",
    "url": "/assets/main.css",
    "snippet": null
  },
  {
    "id": "redirects-json",
    "type": "pages",
    "date": "",
    "title": "redirects.json",
    "boosts": "",
    "tags": "",
    "content": "{}\n",
    "url": "/redirects.json",
    "snippet": null
  },
  {
    "id": "criteria-are-there-default-example-searches-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Are there default example searches?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Are there default example searches? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Example searches Criteria: Are there default example searches? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Are there default example searches? Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Yes Ex. [history of the birkin bag] [What is the Mandalorian?] [write a review of the best michelin star chefs in the world] Go to apps, eg [go aws console] Note that these are not links to searches because search-by-URL is not available in Andi. Yes Ex. [companies working on fusion] [blog posts to learn how LLMs work] [best restaurants in San Francisco] [fun concerts in San Francisco] Yes Clicking in the searchbox. Ex. [Morocco earthquake 2023] [how do bacteriophages differ from antibiotics] [what causes the Northern Lights] [super blue moon] [difference between stop motion and claymation] [future of artificial selection] [miracle berries] [how do reading skills change human brain] In the mobile app. Listed as 'Popular', ex. [examples of preventive medicine practices] [what are the most popular podcast categories] [breathtaking adventure books about Africa] [how does skiplagging work] Yes Listed as 'Explore', ex. [Why we shouldn't use useMemo() in React everywhere] [The 2005 Japanese PS2 videogame Ikusagami renders thousands of enemies on screen. How can I achieve this in Godot 4?] [Why are there so many potholes in SF and can I get money if my car is broken by one] [How do I conditionally import components in Astro?] [Compare and contrast H100 availability across Lambda Labs and AWS] Yes Ex. [Check today's weather] [Find cost-effective vacations] [Shop for running shoes] Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Andi Search Are there default example searches? Yes Ex. [history of the birkin bag] [What is the Mandalorian?] [write a review of the best michelin star chefs in the world] Go to apps, eg [go aws console] Note that these are not links to searches because search-by-URL is not available in Andi. Metaphor Are there default example searches? Yes Ex. [companies working on fusion] [blog posts to learn how LLMs work] [best restaurants in San Francisco] [fun concerts in San Francisco] Perplexity AI Are there default example searches? Yes Clicking in the searchbox. Ex. [Morocco earthquake 2023] [how do bacteriophages differ from antibiotics] [what causes the Northern Lights] [super blue moon] [difference between stop motion and claymation] [future of artificial selection] [miracle berries] [how do reading skills change human brain] In the mobile app. Listed as 'Popular', ex. [examples of preventive medicine practices] [what are the most popular podcast categories] [breathtaking adventure books about Africa] [how does skiplagging work] Phind Are there default example searches? Yes Listed as 'Explore', ex. [Why we shouldn't use useMemo() in React everywhere] [The 2005 Japanese PS2 videogame Ikusagami renders thousands of enemies on screen. How can I achieve this in Godot 4?] [Why are there so many potholes in SF and can I get money if my car is broken by one] [How do I conditionally import components in Astro?] [Compare and contrast H100 availability across Lambda Labs and AWS] You.com Are there default example searches? Yes Ex. [Check today's weather] [Find cost-effective vacations] [Shop for running shoes]",
    "url": "/criteria/are-there-default-example-searches.html",
    "snippet": null
  },
  {
    "id": "criteria-do-example-searches-have-cre-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Do default example searches have contextually relevant explanation on sourcing?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Do default example searches have contextually relevant explanation on sourcing? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Example searches Criteria: Do default example searches have contextually relevant explanation on sourcing? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Do default example searches have contextually relevant explanation on sourcing? No No Partial On mobile app there are example searches listed above the search bar, explained only by the word 'Popular' No No Andi Search Do default example searches have contextually relevant explanation on sourcing? No Metaphor Do default example searches have contextually relevant explanation on sourcing? No Perplexity AI Do default example searches have contextually relevant explanation on sourcing? Partial On mobile app there are example searches listed above the search bar, explained only by the word 'Popular' Phind Do default example searches have contextually relevant explanation on sourcing? No You.com Do default example searches have contextually relevant explanation on sourcing? No",
    "url": "/criteria/do-example-searches-have-cre.html",
    "snippet": null
  },
  {
    "id": "criteria-searchable-repository-of-examples-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Is there a &quot;searchable repository of examples&quot;?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Is there a \"searchable repository of examples\"? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Example searches Criteria: Is there a \"searchable repository of examples\"? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Is there a \"searchable repository of examples\"? The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. No Partial `# show-and-tell` channel in the Discord channel: 'Show off what you've found with Metaphor!' Partial **(1)** `# 💗 | sharing` channel in the Discord channel: 'Share cool results that you got with Perplexity! Please keep everything safe and friendly.'**(2)** `# 🔎 │ ask` channel in the Discord channel: 'ask \\@perplexity anything. Check pinned for usage.' (with a weekly challenge for the best question; pinned message show example queries (note these are queries of their Discord bot))**(3)** A [Discover](https://www.perplexity.ai/discover) page shares 30 example queries. Partial `# 🤯impressive-results` channel in the Discord channel No `# create-and-share` channel in the Discord channel appears focused on image generation rather than searching with You.com All or YouChat. The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. Andi Search Is there a \"searchable repository of examples\"? No Metaphor Is there a \"searchable repository of examples\"? Partial `# show-and-tell` channel in the Discord channel: 'Show off what you've found with Metaphor!' Perplexity AI Is there a \"searchable repository of examples\"? Partial **(1)** `# 💗 | sharing` channel in the Discord channel: 'Share cool results that you got with Perplexity! Please keep everything safe and friendly.'**(2)** `# 🔎 │ ask` channel in the Discord channel: 'ask \\@perplexity anything. Check pinned for usage.' (with a weekly challenge for the best question; pinned message show example queries (note these are queries of their Discord bot))**(3)** A [Discover](https://www.perplexity.ai/discover) page shares 30 example queries. Phind Is there a \"searchable repository of examples\"? Partial `# 🤯impressive-results` channel in the Discord channel You.com Is there a \"searchable repository of examples\"? No `# create-and-share` channel in the Discord channel appears focused on image generation rather than searching with You.com All or YouChat.",
    "url": "/criteria/searchable-repository-of-examples.html",
    "snippet": null
  },
  {
    "id": "criteria-can-you-share-a-link-to-the-results-or-conversation-html",
    "type": "pages",
    "date": "2023-09-21 14:03:18 -0700",
    "title": "Criteria: Can you share a link to the results or conversation?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Can you share a link to the results or conversation? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Sharing searching Criteria: Can you share a link to the results or conversation? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Can you share a link to the results or conversation? Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. No No Yes Yes Yes Requires sign-in. Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. Andi Search Can you share a link to the results or conversation? No Metaphor Can you share a link to the results or conversation? No Perplexity AI Can you share a link to the results or conversation? Yes Phind Can you share a link to the results or conversation? Yes You.com Can you share a link to the results or conversation? Yes Requires sign-in.",
    "url": "/criteria/can-you-share-a-link-to-the-results-or-conversation.html",
    "snippet": null
  },
  {
    "id": "criteria-is-there-an-explanation-of-how-share-interface-works-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Is there an explanation of how the share interface works provided or linked to in the interface itself?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Is there an explanation of how the share interface works provided or linked to in the interface itself? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Sharing searching Criteria: Is there an explanation of how the share interface works provided or linked to in the interface itself? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Is there an explanation of how the share interface works provided or linked to in the interface itself? Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: N/A N/A Partial The share link interface consists of the button, with a lock and labelled 'Share', and a popup showing the current 'Secret' state and an option to make 'Shareable:Clicking 'Shareable' copies the link and presents options to facilitate sharing directly to Twitter, WhatsApp, and Facebook: No The share link interface consists of the share button icon and a popup: Partial The share link interface consists of the share button icon and a popup which says 'Share YouChat transcript' and 'Anyone with a link will be able to view your full transcript with YouChat in this session.' and presents a link to the search: Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: Andi Search Is there an explanation of how the share interface works provided or linked to in the interface itself? N/A Metaphor Is there an explanation of how the share interface works provided or linked to in the interface itself? N/A Perplexity AI Is there an explanation of how the share interface works provided or linked to in the interface itself? Partial The share link interface consists of the button, with a lock and labelled 'Share', and a popup showing the current 'Secret' state and an option to make 'Shareable:Clicking 'Shareable' copies the link and presents options to facilitate sharing directly to Twitter, WhatsApp, and Facebook: Phind Is there an explanation of how the share interface works provided or linked to in the interface itself? No The share link interface consists of the share button icon and a popup: You.com Is there an explanation of how the share interface works provided or linked to in the interface itself? Partial The share link interface consists of the share button icon and a popup which says 'Share YouChat transcript' and 'Anyone with a link will be able to view your full transcript with YouChat in this session.' and presents a link to the search:",
    "url": "/criteria/is-there-an-explanation-of-how-share-interface-works.html",
    "snippet": null
  },
  {
    "id": "criteria-do-shared-links-update-if-the-s-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Do shared links update if the sharee&apos;s interaction with the system continues??",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Do shared links update if the sharee's interaction with the system continues?? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Sharing searching Criteria: Do shared links update if the sharee's interaction with the system continues?? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Do shared links update if the sharee's interaction with the system continues?? Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. N/A N/A (1) Links to searches reproduce the search from the URL.(2) Metaphor does not have follow-on queries/questions. Sometimes (1) It is not explicitly stated, but it appears that further interactions by the sharer on the same 'thread' may break the original link (`error=ThreadAccessNotAllowed` appears in the URL, and there is a temporary popup saying the same; try: example): (2) Perplexity has another way to share as well: Collections. A search shared to a collection and then subsequently expanded is updated for the sharee(s). No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link. No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link. Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. Andi Search Do shared links update if the sharee's interaction with the system continues?? N/A Metaphor Do shared links update if the sharee's interaction with the system continues?? N/A (1) Links to searches reproduce the search from the URL.(2) Metaphor does not have follow-on queries/questions. Perplexity AI Do shared links update if the sharee's interaction with the system continues?? Sometimes (1) It is not explicitly stated, but it appears that further interactions by the sharer on the same 'thread' may break the original link (`error=ThreadAccessNotAllowed` appears in the URL, and there is a temporary popup saying the same; try: example): (2) Perplexity has another way to share as well: Collections. A search shared to a collection and then subsequently expanded is updated for the sharee(s). Phind Do shared links update if the sharee's interaction with the system continues?? No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link. You.com Do shared links update if the sharee's interaction with the system continues?? No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link.",
    "url": "/criteria/do-shared-links-update-if-the-s.html",
    "snippet": null
  },
  {
    "id": "criteria-is-there-a-social-share-card-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Is there a social share card?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Is there a social share card? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Sharing searching Criteria: Is there a social share card? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Is there a social share card? Quality of share cards may influence the engagement on social platforms. No Yes Links to searches produce a social share card. Yes Share interface links produce a social share card. No Yes Share interface links produce a social share card. Quality of share cards may influence the engagement on social platforms. Andi Search Is there a social share card? No Metaphor Is there a social share card? Yes Links to searches produce a social share card. Perplexity AI Is there a social share card? Yes Share interface links produce a social share card. Phind Is there a social share card? No You.com Is there a social share card? Yes Share interface links produce a social share card.",
    "url": "/criteria/is-there-a-social-share-card.html",
    "snippet": null
  },
  {
    "id": "criteria-share-links-indexed-and-searchable-html",
    "type": "pages",
    "date": "2023-09-26 16:30:59 -0700",
    "title": "Criteria: Are share links (or links to searches) indexed and searchable in search engines (or the system itself)?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Sharing searching Criteria: Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. N/A Yes You can find links to searches in Google: g[site:https://metaphor.systems/search].Note: There are no 'conversations' on Metaphor.Google result count: 6 Yes You can find shared links on Google: g[site:https://www.perplexity.ai/search/]Many of these searches may be sourced from the links provided on the Perplexity AI Discover page (which appear to be from Perplexity Bot (accessed via their Discord server). Perplexity Bot is identified as the account for many of the searches found on Google (example link here), others are anonymously sourced (example) or identified accounts (N.b. A few of the results are links I've shared myself: g[site:perplexity.ai/search danielsgriffin].Google result count: 3,210 Yes You can find shared links on Google: g[site:phind.com/search]Note: Finding a Jan 19, 2023 tweet from Phind's CEO is what initiated my review of this criteria.Google result count: 6 Partial You can find links to searches on Google: g[site:you.com/search]Google result count: 267It does not appear that shared YouChat links are currently searchable on Google. @vijayabhaskarj reported finding chat links on Google on Jun 4, 2023. Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. Andi Search Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? N/A Metaphor Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Yes You can find links to searches in Google: g[site:https://metaphor.systems/search].Note: There are no 'conversations' on Metaphor.Google result count: 6 Perplexity AI Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Yes You can find shared links on Google: g[site:https://www.perplexity.ai/search/]Many of these searches may be sourced from the links provided on the Perplexity AI Discover page (which appear to be from Perplexity Bot (accessed via their Discord server). Perplexity Bot is identified as the account for many of the searches found on Google (example link here), others are anonymously sourced (example) or identified accounts (N.b. A few of the results are links I've shared myself: g[site:perplexity.ai/search danielsgriffin].Google result count: 3,210 Phind Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Yes You can find shared links on Google: g[site:phind.com/search]Note: Finding a Jan 19, 2023 tweet from Phind's CEO is what initiated my review of this criteria.Google result count: 6 You.com Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Partial You can find links to searches on Google: g[site:you.com/search]Google result count: 267It does not appear that shared YouChat links are currently searchable on Google. @vijayabhaskarj reported finding chat links on Google on Jun 4, 2023.",
    "url": "/criteria/share-links-indexed-and-searchable.html",
    "snippet": null
  },
  {
    "id": "criteria-can-you-search-by-url-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Can you search by URL?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Can you search by URL? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Standards & Openness Criteria: Can you search by URL? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Can you search by URL? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. No Yes Example: What is an LLM? Yes Example: What is an LLM? Yes Example: What is an LLM? Yes Example: What is an LLM? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. Andi Search Can you search by URL? No Metaphor Can you search by URL? Yes Example: What is an LLM? Perplexity AI Can you search by URL? Yes Example: What is an LLM? Phind Can you search by URL? Yes Example: What is an LLM? You.com Can you search by URL? Yes Example: What is an LLM?",
    "url": "/criteria/can-you-search-by-url.html",
    "snippet": null
  },
  {
    "id": "criteria-is-there-an-api-html",
    "type": "pages",
    "date": "2023-10-05",
    "title": "Criteria: Is there an API?",
    "boosts": "",
    "tags": "",
    "content": "Criteria: Is there an API? 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Standards & Openness Criteria: Is there an API? Table View Card View This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Andi Search Metaphor Perplexity AI Phind You.com Is there an API? Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. No Yes No No No You.com does not offer an API for search or chat at this time. However, we are considering creating one in the future. If you would like to be notified when this happens, fill out the form here. source Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. Andi Search Is there an API? No Metaphor Is there an API? Yes Perplexity AI Is there an API? No Phind Is there an API? No You.com Is there an API? No You.com does not offer an API for search or chat at this time. However, we are considering creating one in the future. If you would like to be notified when this happens, fill out the form here. source",
    "url": "/criteria/is-there-an-api.html",
    "snippet": null
  },
  {
    "id": "categories-example-searches-html",
    "type": "pages",
    "date": "",
    "title": "Category: Example searches",
    "boosts": "",
    "tags": "",
    "content": "Category: Example searches 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Example searches Purpose: Help users practice new ways of imagining and formulating queries. Criteria: Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Details: Research suggests that effective prompting of LLMs can be challenging [@zamfirescu-pereira2023johnny] and query formulation even in mainstream web search engines is complicated [@tripodi2018searching]. @mollick2023useful, not specifically re search systems, has called for “large-scale public libraries of prompts”.",
    "url": "/categories/example-searches.html",
    "snippet": null
  },
  {
    "id": "categories-sharing-searching-html",
    "type": "pages",
    "date": "",
    "title": "Category: Sharing searching",
    "boosts": "",
    "tags": "",
    "content": "Category: Sharing searching 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Sharing searching Purpose: Support users in sharing their search experience with others. Criteria: Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Details: Research demonstrates significant value in users communicating about their experiences with tools. Better support for sharing interactions with these systems may improve users collective ability to effectively question/complain, teach, & organize about/around/against these tools (i.e. “working around platform errors and limitations” & “virtual assembly work” {% cite burrell2019control %}, “repairing searching” {% cite griffin2022situating %}, search quality complaints {% cite griffin2022search %}, and end-user audits {% cite metaxa2021auditing lam2022end %}) and improve our “practical knowledge” of the systems {% cite cotter2022practical %}.",
    "url": "/categories/sharing-searching.html",
    "snippet": null
  },
  {
    "id": "categories-standards-and-openness-html",
    "type": "pages",
    "date": "",
    "title": "Category: Standards &amp; Openness",
    "boosts": "",
    "tags": "",
    "content": "Category: Standards & Openness 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Category: Standards & Openness Purpose: Support interoperability and extensibility. Criteria: Can you search by URL? Is there an API? Details: This includes checking if a platform supports searching by URL and if it offers an API.Coming soon: Examine support for the OpenSearch protocol (mdn GitHub Wikipedia); record comments about open source; record contributions to & integrations from open source.",
    "url": "/categories/standards-and-openness.html",
    "snippet": null
  },
  {
    "id": "systems-andi-search-html",
    "type": "pages",
    "date": "",
    "title": "Andi Search",
    "boosts": "",
    "tags": "",
    "content": "Andi Search 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Andi Search https://andisearch.com/ Individual marks: This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Example searches Help users practice new ways of imagining and formulating queries. Research suggests that effective prompting of LLMs can be challenging [@zamfirescu-pereira2023johnny] and query formulation even in mainstream web search engines is complicated [@tripodi2018searching]. @mollick2023useful, not specifically re search systems, has called for “large-scale public libraries of prompts”. Are there default example searches? Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Yes Ex. [history of the birkin bag] [What is the Mandalorian?] [write a review of the best michelin star chefs in the world] Go to apps, eg [go aws console] Note that these are not links to searches because search-by-URL is not available in Andi. Do default example searches have contextually relevant explanation on sourcing? No Is there a \"searchable repository of examples\"? The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. No Sharing searching Support users in sharing their search experience with others. Research demonstrates significant value in users communicating about their experiences with tools. Better support for sharing interactions with these systems may improve users collective ability to effectively question/complain, teach, & organize about/around/against these tools (i.e. “working around platform errors and limitations” & “virtual assembly work” {% cite burrell2019control %}, “repairing searching” {% cite griffin2022situating %}, search quality complaints {% cite griffin2022search %}, and end-user audits {% cite metaxa2021auditing lam2022end %}) and improve our “practical knowledge” of the systems {% cite cotter2022practical %}. Can you share a link to the results or conversation? Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. No Is there an explanation of how the share interface works provided or linked to in the interface itself? Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: N/A Do shared links update if the sharee's interaction with the system continues?? Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. N/A Is there a social share card? Quality of share cards may influence the engagement on social platforms. No Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. N/A Standards & Openness Support interoperability and extensibility. This includes checking if a platform supports searching by URL and if it offers an API.Coming soon: Examine support for the OpenSearch protocol (mdn GitHub Wikipedia); record comments about open source; record contributions to & integrations from open source. Can you search by URL? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. No Is there an API? Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. No",
    "url": "/systems/andi-search.html",
    "snippet": null
  },
  {
    "id": "systems-metaphor-systems-html",
    "type": "pages",
    "date": "",
    "title": "Metaphor",
    "boosts": "",
    "tags": "",
    "content": "Metaphor 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Metaphor https://metaphor.systems/ Individual marks: This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Example searches Help users practice new ways of imagining and formulating queries. Research suggests that effective prompting of LLMs can be challenging [@zamfirescu-pereira2023johnny] and query formulation even in mainstream web search engines is complicated [@tripodi2018searching]. @mollick2023useful, not specifically re search systems, has called for “large-scale public libraries of prompts”. Are there default example searches? Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Yes Ex. [companies working on fusion] [blog posts to learn how LLMs work] [best restaurants in San Francisco] [fun concerts in San Francisco] Do default example searches have contextually relevant explanation on sourcing? No Is there a \"searchable repository of examples\"? The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. Partial `# show-and-tell` channel in the Discord channel: 'Show off what you've found with Metaphor!' Sharing searching Support users in sharing their search experience with others. Research demonstrates significant value in users communicating about their experiences with tools. Better support for sharing interactions with these systems may improve users collective ability to effectively question/complain, teach, & organize about/around/against these tools (i.e. “working around platform errors and limitations” & “virtual assembly work” {% cite burrell2019control %}, “repairing searching” {% cite griffin2022situating %}, search quality complaints {% cite griffin2022search %}, and end-user audits {% cite metaxa2021auditing lam2022end %}) and improve our “practical knowledge” of the systems {% cite cotter2022practical %}. Can you share a link to the results or conversation? Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. No Is there an explanation of how the share interface works provided or linked to in the interface itself? Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: N/A Do shared links update if the sharee's interaction with the system continues?? Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. N/A (1) Links to searches reproduce the search from the URL.(2) Metaphor does not have follow-on queries/questions. Is there a social share card? Quality of share cards may influence the engagement on social platforms. Yes Links to searches produce a social share card. Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. Yes You can find links to searches in Google: g[site:https://metaphor.systems/search].Note: There are no 'conversations' on Metaphor.Google result count: 6 Standards & Openness Support interoperability and extensibility. This includes checking if a platform supports searching by URL and if it offers an API.Coming soon: Examine support for the OpenSearch protocol (mdn GitHub Wikipedia); record comments about open source; record contributions to & integrations from open source. Can you search by URL? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. Yes Example: What is an LLM? Is there an API? Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. Yes",
    "url": "/systems/metaphor-systems.html",
    "snippet": null
  },
  {
    "id": "systems-perplexity-ai-html",
    "type": "pages",
    "date": "",
    "title": "Perplexity AI",
    "boosts": "",
    "tags": "",
    "content": "Perplexity AI 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Perplexity AI https://perplexity.ai/ Individual marks: This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Example searches Help users practice new ways of imagining and formulating queries. Research suggests that effective prompting of LLMs can be challenging [@zamfirescu-pereira2023johnny] and query formulation even in mainstream web search engines is complicated [@tripodi2018searching]. @mollick2023useful, not specifically re search systems, has called for “large-scale public libraries of prompts”. Are there default example searches? Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Yes Clicking in the searchbox. Ex. [Morocco earthquake 2023] [how do bacteriophages differ from antibiotics] [what causes the Northern Lights] [super blue moon] [difference between stop motion and claymation] [future of artificial selection] [miracle berries] [how do reading skills change human brain] In the mobile app. Listed as 'Popular', ex. [examples of preventive medicine practices] [what are the most popular podcast categories] [breathtaking adventure books about Africa] [how does skiplagging work] Do default example searches have contextually relevant explanation on sourcing? Partial On mobile app there are example searches listed above the search bar, explained only by the word 'Popular' Is there a \"searchable repository of examples\"? The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. Partial **(1)** `# 💗 | sharing` channel in the Discord channel: 'Share cool results that you got with Perplexity! Please keep everything safe and friendly.'**(2)** `# 🔎 │ ask` channel in the Discord channel: 'ask \\@perplexity anything. Check pinned for usage.' (with a weekly challenge for the best question; pinned message show example queries (note these are queries of their Discord bot))**(3)** A [Discover](https://www.perplexity.ai/discover) page shares 30 example queries. Sharing searching Support users in sharing their search experience with others. Research demonstrates significant value in users communicating about their experiences with tools. Better support for sharing interactions with these systems may improve users collective ability to effectively question/complain, teach, & organize about/around/against these tools (i.e. “working around platform errors and limitations” & “virtual assembly work” {% cite burrell2019control %}, “repairing searching” {% cite griffin2022situating %}, search quality complaints {% cite griffin2022search %}, and end-user audits {% cite metaxa2021auditing lam2022end %}) and improve our “practical knowledge” of the systems {% cite cotter2022practical %}. Can you share a link to the results or conversation? Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. Yes Is there an explanation of how the share interface works provided or linked to in the interface itself? Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: Partial The share link interface consists of the button, with a lock and labelled 'Share', and a popup showing the current 'Secret' state and an option to make 'Shareable:Clicking 'Shareable' copies the link and presents options to facilitate sharing directly to Twitter, WhatsApp, and Facebook: Do shared links update if the sharee's interaction with the system continues?? Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. Sometimes (1) It is not explicitly stated, but it appears that further interactions by the sharer on the same 'thread' may break the original link (`error=ThreadAccessNotAllowed` appears in the URL, and there is a temporary popup saying the same; try: example): (2) Perplexity has another way to share as well: Collections. A search shared to a collection and then subsequently expanded is updated for the sharee(s). Is there a social share card? Quality of share cards may influence the engagement on social platforms. Yes Share interface links produce a social share card. Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. Yes You can find shared links on Google: g[site:https://www.perplexity.ai/search/]Many of these searches may be sourced from the links provided on the Perplexity AI Discover page (which appear to be from Perplexity Bot (accessed via their Discord server). Perplexity Bot is identified as the account for many of the searches found on Google (example link here), others are anonymously sourced (example) or identified accounts (N.b. A few of the results are links I've shared myself: g[site:perplexity.ai/search danielsgriffin].Google result count: 3,210 Standards & Openness Support interoperability and extensibility. This includes checking if a platform supports searching by URL and if it offers an API.Coming soon: Examine support for the OpenSearch protocol (mdn GitHub Wikipedia); record comments about open source; record contributions to & integrations from open source. Can you search by URL? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. Yes Example: What is an LLM? Is there an API? Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. No",
    "url": "/systems/perplexity-ai.html",
    "snippet": null
  },
  {
    "id": "systems-phind-search-html",
    "type": "pages",
    "date": "",
    "title": "Phind",
    "boosts": "",
    "tags": "",
    "content": "Phind 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com Phind https://phind.com/ Individual marks: This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Example searches Help users practice new ways of imagining and formulating queries. Research suggests that effective prompting of LLMs can be challenging [@zamfirescu-pereira2023johnny] and query formulation even in mainstream web search engines is complicated [@tripodi2018searching]. @mollick2023useful, not specifically re search systems, has called for “large-scale public libraries of prompts”. Are there default example searches? Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Yes Listed as 'Explore', ex. [Why we shouldn't use useMemo() in React everywhere] [The 2005 Japanese PS2 videogame Ikusagami renders thousands of enemies on screen. How can I achieve this in Godot 4?] [Why are there so many potholes in SF and can I get money if my car is broken by one] [How do I conditionally import components in Astro?] [Compare and contrast H100 availability across Lambda Labs and AWS] Do default example searches have contextually relevant explanation on sourcing? No Is there a \"searchable repository of examples\"? The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. Partial `# 🤯impressive-results` channel in the Discord channel Sharing searching Support users in sharing their search experience with others. Research demonstrates significant value in users communicating about their experiences with tools. Better support for sharing interactions with these systems may improve users collective ability to effectively question/complain, teach, & organize about/around/against these tools (i.e. “working around platform errors and limitations” & “virtual assembly work” {% cite burrell2019control %}, “repairing searching” {% cite griffin2022situating %}, search quality complaints {% cite griffin2022search %}, and end-user audits {% cite metaxa2021auditing lam2022end %}) and improve our “practical knowledge” of the systems {% cite cotter2022practical %}. Can you share a link to the results or conversation? Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. Yes Is there an explanation of how the share interface works provided or linked to in the interface itself? Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: No The share link interface consists of the share button icon and a popup: Do shared links update if the sharee's interaction with the system continues?? Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link. Is there a social share card? Quality of share cards may influence the engagement on social platforms. No Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. Yes You can find shared links on Google: g[site:phind.com/search]Note: Finding a Jan 19, 2023 tweet from Phind's CEO is what initiated my review of this criteria.Google result count: 6 Standards & Openness Support interoperability and extensibility. This includes checking if a platform supports searching by URL and if it offers an API.Coming soon: Examine support for the OpenSearch protocol (mdn GitHub Wikipedia); record comments about open source; record contributions to & integrations from open source. Can you search by URL? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. Yes Example: What is an LLM? Is there an API? Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. No",
    "url": "/systems/phind-search.html",
    "snippet": null
  },
  {
    "id": "systems-you-search-html",
    "type": "pages",
    "date": "",
    "title": "You.com",
    "boosts": "",
    "tags": "",
    "content": "You.com 🚧 This prototype is actively under construction. 🚧   Please provide feedback at github/danielsgriffin/SearchRights/issues or via email to daniel.griffin@berkeley.edu. SearchRights About Table Log Criteria Example searches Are there default example searches? Do default example searches have contextually relevant explanation on sourcing? Is there a \"searchable repository of examples\"? Sharing searching Can you share a link to the results or conversation? Is there an explanation of how the share interface works provided or linked to in the interface itself? Do shared links update if the sharee's interaction with the system continues?? Is there a social share card? Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Standards & Openness Can you search by URL? Is there an API? Search Systems Andi Search Metaphor Perplexity AI Phind You.com You.com https://you.com/ Individual marks: This table is optimized for larger screens. Rotate your device to landscape mode for the best experience. Example searches Help users practice new ways of imagining and formulating queries. Research suggests that effective prompting of LLMs can be challenging [@zamfirescu-pereira2023johnny] and query formulation even in mainstream web search engines is complicated [@tripodi2018searching]. @mollick2023useful, not specifically re search systems, has called for “large-scale public libraries of prompts”. Are there default example searches? Comment: It may be interesting to also consider whether these queries demonstrate an advantage of the generative search capabilities or not. Yes Ex. [Check today's weather] [Find cost-effective vacations] [Shop for running shoes] Do default example searches have contextually relevant explanation on sourcing? No Is there a \"searchable repository of examples\"? The phrase \"searchable repository of examples\" comes from Zamfirescu-Pereira et al., 2023. They point to a \"prompt book\" for DALL·E. Other examples, also in the image generation domain, include Lexica (marketing itself as \"The Stable Diffusion search engine\"). See also the searchable LangChain Hub prompt repository for developers. No `# create-and-share` channel in the Discord channel appears focused on image generation rather than searching with You.com All or YouChat. Sharing searching Support users in sharing their search experience with others. Research demonstrates significant value in users communicating about their experiences with tools. Better support for sharing interactions with these systems may improve users collective ability to effectively question/complain, teach, & organize about/around/against these tools (i.e. “working around platform errors and limitations” & “virtual assembly work” {% cite burrell2019control %}, “repairing searching” {% cite griffin2022situating %}, search quality complaints {% cite griffin2022search %}, and end-user audits {% cite metaxa2021auditing lam2022end %}) and improve our “practical knowledge” of the systems {% cite cotter2022practical %}. Can you share a link to the results or conversation? Is there a share interface? For example, this is supported on OpenAI's ChatGPT and Google's Bard. It is not supported on Anthropic's Claude. Yes Requires sign-in. Is there an explanation of how the share interface works provided or linked to in the interface itself? Examples:(1) The share interface in OpenAI's ChatGPT has a \"More Info \" link to their FAQ page: ChatGPT Shared Links FAQ:(2) The share interface in Google's Bard has a \"Learn more\" link to a Bard Help page: Share your Bard chats: Partial The share link interface consists of the share button icon and a popup which says 'Share YouChat transcript' and 'Anyone with a link will be able to view your full transcript with YouChat in this session.' and presents a link to the search: Do shared links update if the sharee's interaction with the system continues?? Example: Here is the interaction in ChatGPT, per ChatGPT Shared Links FAQ: If I continue the conversation after I create a shared link, will the rest of my conversation appear in the shared link?No. Think of a shared link as a snapshot of a conversation up to the point at which you generate the shared link. No It is not explicitly stated, but it appears that further interactions by the sharer on the same chat are NOT updated at the shared link. Is there a social share card? Quality of share cards may influence the engagement on social platforms. Yes Share interface links produce a social share card. Are share links (or links to searches) indexed and searchable in search engines (or the system itself)? Permitting share links to be indexed by search engines may allow searchers elsewhere to find and evaluate the quality of the system responses. Depending on the disclosure in the interface this may pose a privacy risk to users. It may be viewed explicitly as a growth strategy by a search system.Evaluation details: I am currently looking only at `site:` searches on Google.See a links to conversations about this on Twitter here. Partial You can find links to searches on Google: g[site:you.com/search]Google result count: 267It does not appear that shared YouChat links are currently searchable on Google. @vijayabhaskarj reported finding chat links on Google on Jun 4, 2023. Standards & Openness Support interoperability and extensibility. This includes checking if a platform supports searching by URL and if it offers an API.Coming soon: Examine support for the OpenSearch protocol (mdn GitHub Wikipedia); record comments about open source; record contributions to & integrations from open source. Can you search by URL? Searching by URL has long been a staple approach to searching. This allows people to link to (live) searches (to bookmark or share with others) and to integrate searching within simple scripts. This also supports auditing. Yes Example: What is an LLM? Is there an API? Searching by API may better support evaluations of the search results and the development of modifications or extensions building on or with the search system. No You.com does not offer an API for search or chat at this time. However, we are considering creating one in the future. If you would like to be notified when this happens, fill out the form here. source",
    "url": "/systems/you-search.html",
    "snippet": null
  },
  {
    "id": "feed-xml",
    "type": "pages",
    "date": "",
    "title": "feed.xml",
    "boosts": "",
    "tags": "",
    "content": "\n  \n    \n      &lt;?xml version=”1.0” encoding=”utf-8”?&gt;{% if page.xsl %}&lt;?xml-stylesheet type=”text/xml” href=”{{ ‘/feed.xslt.xml’\n      absolute_url }}”?&gt;{% endif %}&lt;feed xmlns=”http://www.w3.org/2005/Atom” {% if site.lang %}xml:lang=”{{ site.lang }}”{% endif %}&gt;Jekyll&lt;link href=”{{ page.url\n      absolute_url }}” rel=”self” type=”application/atom+xml” /&gt;&lt;link href=”{{ ‘/’\n      absolute_url }}” rel=”alternate” type=”text/html” {% if site.lang %}hreflang=”{{ site.lang }}” {% endif %}/&gt;{{ site.time\n      date_to_xmlschema }}&lt;/updated&gt;{{ page.url\n      absolute_url\n      xml_escape }}&lt;/id&gt;{% assign title = site.title\n      default: site.name %}{% if page.collection != “posts” %}{% assign collection = page.collection\n      capitalize %}{% assign title = title\n      append: “\n      ”\n      append: collection %}{% endif %}{% if page.category %}{% assign category = page.category\n      capitalize %}{% assign title = title\n      append: “\n      ”\n      append: category %}{% endif %}{% if title %}{{ title\n      smartify\n      xml_escape }}&lt;/title&gt;{% endif %}{% if site.description %}{{ site.description\n      xml_escape }}&lt;/subtitle&gt;{% endif %}{% if site.author %}{{ site.author.name\n      default: site.author\n      xml_escape }}&lt;/name&gt;{% if site.author.email %}{{ site.author.email\n      xml_escape }}&lt;/email&gt;{% endif %}{% if site.author.uri %}{{ site.author.uri\n      xml_escape }}&lt;/uri&gt;{% endif %}&lt;/author&gt;{% endif %}{% if page.tags %}{% assign posts = site.tags[page.tags] %}{% else %}{% assign posts = site[page.collection] %}{% endif %}{% if page.category %}{% assign posts = posts\n      where: “categories”, page.category %}{% endif %}{% unless site.show_drafts %}{% assign posts = posts\n      where_exp: “post”, “post.draft != true” %}{% endunless %}{% assign posts = posts\n      sort: “date”\n      reverse %}{% assign posts_limit = site.feed.posts_limit\n      default: 10 %}{% for post in posts limit: posts_limit %}&lt;entry{% if post.lang %}{{“ “}}xml:lang=”{{ post.lang }}”{% endif %}&gt;{% assign post_title = post.title\n      smartify\n      strip_html\n      normalize_whitespace\n      xml_escape %}{{ post_title }}&lt;link href=”{{ post.url\n      absolute_url }}” rel=”alternate” type=”text/html” title=”{{ post_title }}” /&gt;{{ post.date\n      date_to_xmlschema }}&lt;/published&gt;{{ post.last_modified_at\n      default: post.date\n      date_to_xmlschema }}&lt;/updated&gt;{{ post.id\n      absolute_url\n      xml_escape }}&lt;/id&gt;{% assign excerpt_only = post.feed.excerpt_only\n      default: site.feed.excerpt_only %}{% unless excerpt_only %}&lt;content type=”html” xml:base=”{{ post.url\n      absolute_url\n      xml_escape }}”&gt;&lt;![CDATA[{{ post.content\n      strip }}]]&gt;&lt;/content&gt;{% endunless %}{% assign post_author = post.author\n      default: post.authors[0]\n      default: site.author %}{% assign post_author = site.data.authors[post_author]\n      default: post_author %}{% assign post_author_email = post_author.email\n      default: nil %}{% assign post_author_uri = post_author.uri\n      default: nil %}{% assign post_author_name = post_author.name\n      default: post_author %}{{ post_author_name\n      default: “”\n      xml_escape }}&lt;/name&gt;{% if post_author_email %}{{ post_author_email\n      xml_escape }}&lt;/email&gt;{% endif %}{% if post_author_uri %}{{ post_author_uri\n      xml_escape }}&lt;/uri&gt;{% endif %}&lt;/author&gt;{% if post.category %}&lt;category term=”{{ post.category\n      xml_escape }}” /&gt;{% elsif post.categories %}{% for category in post.categories %}&lt;category term=”{{ category\n      xml_escape }}” /&gt;{% endfor %}{% endif %}{% for tag in post.tags %}&lt;category term=”{{ tag\n      xml_escape }}” /&gt;{% endfor %}{% assign post_summary = post.description\n      default: post.excerpt %}{% if post_summary and post_summary != empty %}&lt;summary type=\"html\"&gt;&lt;![CDATA[{{ post_summary\n      strip_html\n      normalize_whitespace }}]]&gt;&lt;/summary&gt;{% endif %}{% assign post_image = post.image.path\n      default: post.image %}{% if post_image %}{% unless post_image contains “://” %}{% assign post_image = post_image\n      absolute_url %}{% endunless %}&lt;media:thumbnail xmlns:media=”http://search.yahoo.com/mrss/” url=”{{ post_image\n      xml_escape }}” /&gt;&lt;media:content medium=”image” url=”{{ post_image\n      xml_escape }}” xmlns:media=”http://search.yahoo.com/mrss/” /&gt;{% endif %}&lt;/entry&gt;{% endfor %}&lt;/feed&gt;\n    \n  \n\n",
    "url": "/feed.xml",
    "snippet": null
  },
  {
    "id": "sitemap-xml",
    "type": "pages",
    "date": "",
    "title": "",
    "boosts": "",
    "tags": "",
    "content": "&lt;?xml version=”1.0” encoding=”UTF-8”?&gt;\n{% if page.xsl %}&lt;?xml-stylesheet type=”text/xsl” href=”{{ “/sitemap.xsl” | absolute_url }}”?&gt;\n{% endif %}\n{% assign collections = site.collections | where_exp:'collection','collection.output != false' %}{% for collection in collections %}{% assign docs = collection.docs | where_exp:'doc','doc.sitemap != false' %}{% for doc in docs %}\n{{ doc.url | replace:'/index.html','/' | absolute_url | xml_escape }}\n{% if doc.last_modified_at or doc.date %}{{ doc.last_modified_at | default: doc.date | date_to_xmlschema }}\n{% endif %}&lt;/url&gt;\n{% endfor %}{% endfor %}{% assign pages = site.html_pages | where_exp:’doc’,’doc.sitemap != false’ | where_exp:’doc’,’doc.url != “/404.html”’ %}{% for page in pages %}\n{{ page.url | replace:'/index.html','/' | absolute_url | xml_escape }}\n{% if page.last_modified_at %}{{ page.last_modified_at | date_to_xmlschema }}\n{% endif %}&lt;/url&gt;\n{% endfor %}{% assign static_files = page.static_files | where_exp:’page’,’page.sitemap != false’ | where_exp:’page’,’page.name != “404.html”’ %}{% for file in static_files %}\n{{ file.path | replace:'/index.html','/' | absolute_url | xml_escape }}\n{{ file.modified_time | date_to_xmlschema }}\n&lt;/url&gt;\n{% endfor %}&lt;/urlset&gt;\n",
    "url": "/sitemap.xml",
    "snippet": null
  },
  {
    "id": "robots-txt",
    "type": "pages",
    "date": "",
    "title": "",
    "boosts": "",
    "tags": "",
    "content": "\n  \n    \n      Sitemap: {{ “sitemap.xml”\n      absolute_url }}\n    \n  \n\n",
    "url": "/robots.txt",
    "snippet": null
  }
]